Repository: helder-abreu/angular-internationalisation
Catalog: i18n/src/locale/messages.*.xlf
Languages: pt

source: Home
pt: Página principal

source: Settings
pt: Definições

source: Angular i18n EN
pt: Angular i18n PT

source: This is the Home page
pt: Esta é a página principal

source: Let's see how some specific text is displayed using i18n:
pt: Como alguns textos específicos são apresentados usando o i18n

source: Dates: {{ today | date:'fullDate' }}
pt: Datas: {{ today | date:'fullDate' }}

source: Decimals: {{ 123456789 | number }}
pt: Números decimais: {{ 123456789 | number:'pt-PT' }}

source: Currencies: {{ 1234.50 | currency }}
pt: Moedas: {{ 1234.50 | currency:'pt' }}

source: This is the Settings page
pt: Esta é a página de definições

source: Change language
pt: Alterar idioma

source: English (en-US)
pt: Inglês (en-US)

source: Portuguese (pt-PT)
pt: Português (pt-PT)

source: Save
pt: Guardar
